\DOC pp_word_off

\TYPE {pp_word_off : unit -> term_pp_types.userprinter option}

\SYNOPSIS
Turns off the pretty printing of words.

\EXAMPLE

{
- word4Lib.pp_word_signed_bin();
> val it = () : unit
- ``12w``;
> val it = ``~0b100w`` : term
- word4Lib.pp_word_off();
> val it = SOME fn :
  ((grav * grav * grav -> int -> term -> unit) -> grav * grav * grav -> int ->
   ppstream -> term -> unit) option
- ``12w``;
> val it = ``12w`` : term
}

\COMMENTS
Only available after running {mkword.exe}.

\SEEALSO
pp_word_unsigned_bin, pp_word_unsigned_oct, pp_word_unsigned_hex,
pp_word_signed_bin, pp_word_signed_oct, pp_word_signed_dec, pp_word_signed_hex

\ENDDOC
